openfoam_cases/design_C_balanced_revision/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    fan_active_annulus
    {
        type            zeroGradient;
    }
    inlet_blocked
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    solidSurfaces
    {
        type            zeroGradient;
    }
}
